### Handle categorical features-Nominal category

#### Nominal Encoding

1)One hot encoding

2)One hot encoding with many categories

3)Mean encoding(replace with mean)


#### Ordinal Encoding

1)Label encoding(assign values according to the rank of the category)

2)Target guided ordinal encoding (mean and rank accordingly)

#### One Hot Encoding

If there only one or two categories in a feature, you may use get_dummies fn

In [3]:
import pandas as pd

In [5]:
df=pd.read_csv('titanic_train.csv',usecols=['Sex'])

In [6]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [8]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [9]:
df=pd.read_csv('titanic_train.csv',usecols=['Embarked'])

In [10]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [11]:
df.dropna(inplace=True)

In [12]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [14]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

#### one hot encoding with many categoties in a feature

In [17]:
df=pd.read_csv('mercedez.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])

In [18]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [22]:
df['X0'].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [27]:
len(df['X0'].unique()) ## to find out the number of categories in a feature

47

In [24]:
df.columns

Index(['X0', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6'], dtype='object')

In [25]:
for i in df.columns:
    print(len(df[i].unique()));[]

47
27
44
7
4
29
12

In [53]:
df.X0.value_counts() ## to find out frequency of categories

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
l      16
aw     16
ad     14
au     11
b      11
k      11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
g       1
ac      1
Name: X0, dtype: int64

In [33]:
list_10= list(df.X0.value_counts().sort_values(ascending=False).head(10).index)
print(list_10) ## list of categories

['z', 'ak', 'y', 'ay', 't', 'x', 'o', 'f', 'n', 'w']

In [34]:
import numpy as np
for categories in list_10:
    df[categories]=np.where(df['X0']==categories,1,0)

In [57]:
df[['X0']+list_10]

      X0  z  ak  y  ay  t  x  o  f  n  w  X0
0      k  0   0  0   0  0  0  0  0  0  0   k
1      k  0   0  0   0  0  0  0  0  0  0   k
2     az  0   0  0   0  0  0  0  0  0  0  az
3     az  0   0  0   0  0  0  0  0  0  0  az
4     az  0   0  0   0  0  0  0  0  0  0  az
...   .. ..  .. ..  .. .. .. .. .. .. ..  ..
4204  ak  0   1  0   0  0  0  0  0  0  0  ak
4205   j  0   0  0   0  0  0  0  0  0  0   j
4206  ak  0   1  0   0  0  0  0  0  0  0  ak
4207  al  0   0  0   0  0  0  0  0  0  0  al
4208   z  1   0  0   0  0  0  0  0  0  0   z

[4209 rows x 12 columns]

In [44]:
list_10.append('X0')

In [45]:
df[list_10]

      z  ak  y  ay  t  x  o  f  n  w  X0
0     0   0  0   0  0  0  0  0  0  0   k
1     0   0  0   0  0  0  0  0  0  0   k
2     0   0  0   0  0  0  0  0  0  0  az
3     0   0  0   0  0  0  0  0  0  0  az
4     0   0  0   0  0  0  0  0  0  0  az
...  ..  .. ..  .. .. .. .. .. .. ..  ..
4204  0   1  0   0  0  0  0  0  0  0  ak
4205  0   0  0   0  0  0  0  0  0  0   j
4206  0   1  0   0  0  0  0  0  0  0  ak
4207  0   0  0   0  0  0  0  0  0  0  al
4208  1   0  0   0  0  0  0  0  0  0   z

[4209 rows x 11 columns]

#### Count/Frequency Encoding

In [60]:
df=pd.read_csv('mercedez.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])
df

      X0 X1  X2 X3 X4  X5 X6
0      k  v  at  a  d   u  j
1      k  t  av  e  d   y  l
2     az  w   n  c  d   x  j
3     az  t   n  f  d   x  l
4     az  v   n  f  d   h  d
...   .. ..  .. .. ..  .. ..
4204  ak  s  as  c  d  aa  d
4205   j  o   t  d  d  aa  h
4206  ak  v   r  a  d  aa  g
4207  al  r   e  f  d  aa  l
4208   z  r  ae  c  d  aa  g

[4209 rows x 7 columns]

In [62]:
df.shape

(4209, 7)

In [63]:
df.X0.unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [64]:
len(df.X0.unique())

47

In [69]:
df_freq = df.X0.value_counts().to_dict()

In [70]:
df.X0 = df.X0.map(df_freq)
df.head()

    X0 X1  X2 X3 X4 X5 X6
0   11  v  at  a  d  u  j
1   11  t  av  e  d  y  l
2  175  w   n  c  d  x  j
3  175  t   n  f  d  x  l
4  175  v   n  f  d  h  d

In [79]:
def encode(df,variable):
    df_freq = df[variable].value_counts().to_dict()
    df[variable] = df[variable].map(df_freq)

In [91]:
for col in df.columns[0:]:
    encode(df,col)
df.head()

    X0   X1   X2    X3    X4  X5    X6
0   33  408    6   440  4205   1  1039
1   33   31    4   163  4205   1   478
2  175   52  137  1942  4205   2  1039
3  175   31  137  1076  4205   2   478
4  175  408  137  1076  4205   1   625

### Handle categorical features-Ordinal category

#### Ordinal number Encoding or Label encoding

not suitable if there are too many categories.

#### Probability Ratio encoding

In this particular case, Cabin column is encoded with the help of survived data.

In [96]:
df=pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])

In [97]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [98]:
df['Cabin'].fillna('Missing',inplace=True)

In [99]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [101]:
df.Cabin.unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [109]:
df['Cabin']=df.Cabin.astype(str).str[0]

In [110]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [111]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [126]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [127]:
prob_df=pd.DataFrame(prob_df)

In [128]:
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [129]:
prob_df['Died']=1-prob_df['Survived']

In [130]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [131]:
prob_df['Prob_ratio']=prob_df['Survived']/prob_df['Died']

In [132]:
prob_df.head()

       Survived      Died  Prob_ratio
Cabin
A      0.466667  0.533333    0.875000
B      0.744681  0.255319    2.916667
C      0.593220  0.406780    1.458333
D      0.757576  0.242424    3.125000
E      0.750000  0.250000    3.000000

In [134]:
prob_encoded=prob_df['Prob_ratio'].to_dict()

In [135]:
prob_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [136]:
df['Cabin_encoded']=df['Cabin'].map(prob_encoded)

In [138]:
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274